FIO-tests-22-36-07-01-2021-AAAAA/Configs/Test-results/fio-results
read-4k-0: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
read-4k-1: (g=1): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=8
fio-3.16
Starting 2 processes
{
  "fio version" : "fio-3.16",
  "timestamp" : 1610059080,
  "timestamp_ms" : 1610059080125,
  "time" : "Thu Jan  7 22:38:00 2021",
  "global options" : {
    "ioengine" : "libaio",
    "size" : "1G",
    "direct" : "1",
    "runtime" : "30",
    "time_based" : "1",
    "filename" : "/data/fio.test.file"
  },
  "jobs" : [
    {
      "jobname" : "read-4k-0",
      "groupid" : 0,
      "error" : 0,
      "eta" : 0,
      "elapsed" : 61,
      "job options" : {
        "rw" : "read",
        "bs" : "4k",
        "iodepth" : "1",
        "numjobs" : "1"
      },
      "read" : {
        "io_bytes" : 722923520,
        "io_kbytes" : 705980,
        "bw_bytes" : 24096647,
        "bw" : 23531,
        "iops" : 5882.970568,
        "runtime" : 30001,
        "total_ios" : 176495,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 37981,
          "max" : 11170154,
          "mean" : 107255.413870,
          "stddev" : 150301.373055
        },
        "clat_ns" : {
          "min" : 2021,
          "max" : 12407891,
          "mean" : 60541.175489,
          "stddev" : 150283.863908,
          "percentile" : {
            "1.000000" : 2160,
            "5.000000" : 2192,
            "10.000000" : 2256,
            "20.000000" : 2288,
            "30.000000" : 2352,
            "40.000000" : 2384,
            "50.000000" : 2448,
            "60.000000" : 2608,
            "70.000000" : 129536,
            "80.000000" : 134144,
            "90.000000" : 179200,
            "95.000000" : 185344,
            "99.000000" : 222208,
            "99.500000" : 240640,
            "99.900000" : 1597440,
            "99.950000" : 2310144,
            "99.990000" : 7045120
          }
        },
        "lat_ns" : {
          "min" : 121396,
          "max" : 12543655,
          "mean" : 168312.225899,
          "stddev" : 193682.615231
        },
        "bw_min" : 9520,
        "bw_max" : 25307,
        "bw_agg" : 81.360110,
        "bw_mean" : 19144.847458,
        "bw_dev" : 2111.057774,
        "bw_samples" : 59,
        "iops_min" : 2380,
        "iops_max" : 6326,
        "iops_mean" : 4785.847458,
        "iops_stddev" : 527.701516,
        "iops_samples" : 59
      },
      "write" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "percentile" : {
            "1.000000" : 0,
            "5.000000" : 0,
            "10.000000" : 0,
            "20.000000" : 0,
            "30.000000" : 0,
            "40.000000" : 0,
            "50.000000" : 0,
            "60.000000" : 0,
            "70.000000" : 0,
            "80.000000" : 0,
            "90.000000" : 0,
            "95.000000" : 0,
            "99.000000" : 0,
            "99.500000" : 0,
            "99.900000" : 0,
            "99.950000" : 0,
            "99.990000" : 0
          }
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "trim" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "percentile" : {
            "1.000000" : 0,
            "5.000000" : 0,
            "10.000000" : 0,
            "20.000000" : 0,
            "30.000000" : 0,
            "40.000000" : 0,
            "50.000000" : 0,
            "60.000000" : 0,
            "70.000000" : 0,
            "80.000000" : 0,
            "90.000000" : 0,
            "95.000000" : 0,
            "99.000000" : 0,
            "99.500000" : 0,
            "99.900000" : 0,
            "99.950000" : 0,
            "99.990000" : 0
          }
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "sync" : {
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "percentile" : {
            "1.000000" : 0,
            "5.000000" : 0,
            "10.000000" : 0,
            "20.000000" : 0,
            "30.000000" : 0,
            "40.000000" : 0,
            "50.000000" : 0,
            "60.000000" : 0,
            "70.000000" : 0,
            "80.000000" : 0,
            "90.000000" : 0,
            "95.000000" : 0,
            "99.000000" : 0,
            "99.500000" : 0,
            "99.900000" : 0,
            "99.950000" : 0,
            "99.990000" : 0
          }
        },
        "total_ios" : 0
      },
      "job_runtime" : 30000,
      "usr_cpu" : 3.803333,
      "sys_cpu" : 65.880000,
      "ctx" : 65099,
      "majf" : 0,
      "minf" : 14,
      "iodepth_level" : {
        "1" : 100.000000,
        "2" : 0.000000,
        "4" : 0.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        ">=64" : 0.000000
      },
      "iodepth_submit" : {
        "0" : 0.000000,
        "4" : 100.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.000000
      },
      "iodepth_complete" : {
        "0" : 0.000000,
        "4" : 100.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.000000
      },
      "latency_ns" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000
      },
      "latency_us" : {
        "2" : 0.000000,
        "4" : 63.910026,
        "10" : 0.163744,
        "20" : 0.094054,
        "50" : 0.023797,
        "100" : 0.030029,
        "250" : 35.356809,
        "500" : 0.273096,
        "750" : 0.019831,
        "1000" : 0.010000
      },
      "latency_ms" : {
        "2" : 0.030029,
        "4" : 0.067991,
        "10" : 0.017564,
        "20" : 0.010000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000,
        "2000" : 0.000000,
        ">=2000" : 0.000000
      },
      "latency_depth" : 1,
      "latency_target" : 0,
      "latency_percentile" : 100.000000,
      "latency_window" : 0
    },
    {
      "jobname" : "read-4k-1",
      "groupid" : 1,
      "error" : 0,
      "eta" : 0,
      "elapsed" : 61,
      "job options" : {
        "rw" : "read",
        "bs" : "4k",
        "iodepth" : "8",
        "numjobs" : "1"
      },
      "read" : {
        "io_bytes" : 1832685568,
        "io_kbytes" : 1789732,
        "bw_bytes" : 61087482,
        "bw" : 59655,
        "iops" : 14913.936202,
        "runtime" : 30001,
        "total_ios" : 447433,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 4143,
          "max" : 18950159,
          "mean" : 48820.106342,
          "stddev" : 151636.607193
        },
        "clat_ns" : {
          "min" : 4715,
          "max" : 19633671,
          "mean" : 486178.835929,
          "stddev" : 518021.904645,
          "percentile" : {
            "1.000000" : 88576,
            "5.000000" : 89600,
            "10.000000" : 191488,
            "20.000000" : 207872,
            "30.000000" : 313344,
            "40.000000" : 391168,
            "50.000000" : 460800,
            "60.000000" : 493568,
            "70.000000" : 577536,
            "80.000000" : 593920,
            "90.000000" : 724992,
            "95.000000" : 929792,
            "99.000000" : 1974272,
            "99.500000" : 3031040,
            "99.900000" : 9240576,
            "99.950000" : 11075584,
            "99.990000" : 11468800
          }
        },
        "lat_ns" : {
          "min" : 123761,
          "max" : 19638264,
          "mean" : 535363.828218,
          "stddev" : 530379.887367
        },
        "bw_min" : 26679,
        "bw_max" : 69728,
        "bw_agg" : 99.711732,
        "bw_mean" : 59483.033898,
        "bw_dev" : 12061.306900,
        "bw_samples" : 59,
        "iops_min" : 6669,
        "iops_max" : 17432,
        "iops_mean" : 14870.728814,
        "iops_stddev" : 3015.356088,
        "iops_samples" : 59
      },
      "write" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "percentile" : {
            "1.000000" : 0,
            "5.000000" : 0,
            "10.000000" : 0,
            "20.000000" : 0,
            "30.000000" : 0,
            "40.000000" : 0,
            "50.000000" : 0,
            "60.000000" : 0,
            "70.000000" : 0,
            "80.000000" : 0,
            "90.000000" : 0,
            "95.000000" : 0,
            "99.000000" : 0,
            "99.500000" : 0,
            "99.900000" : 0,
            "99.950000" : 0,
            "99.990000" : 0
          }
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "trim" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "percentile" : {
            "1.000000" : 0,
            "5.000000" : 0,
            "10.000000" : 0,
            "20.000000" : 0,
            "30.000000" : 0,
            "40.000000" : 0,
            "50.000000" : 0,
            "60.000000" : 0,
            "70.000000" : 0,
            "80.000000" : 0,
            "90.000000" : 0,
            "95.000000" : 0,
            "99.000000" : 0,
            "99.500000" : 0,
            "99.900000" : 0,
            "99.950000" : 0,
            "99.990000" : 0
          }
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "sync" : {
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "percentile" : {
            "1.000000" : 0,
            "5.000000" : 0,
            "10.000000" : 0,
            "20.000000" : 0,
            "30.000000" : 0,
            "40.000000" : 0,
            "50.000000" : 0,
            "60.000000" : 0,
            "70.000000" : 0,
            "80.000000" : 0,
            "90.000000" : 0,
            "95.000000" : 0,
            "99.000000" : 0,
            "99.500000" : 0,
            "99.900000" : 0,
            "99.950000" : 0,
            "99.990000" : 0
          }
        },
        "total_ios" : 0
      },
      "job_runtime" : 30000,
      "usr_cpu" : 6.250000,
      "sys_cpu" : 72.490000,
      "ctx" : 43892,
      "majf" : 0,
      "minf" : 22,
      "iodepth_level" : {
        "1" : 0.100000,
        "2" : 0.100000,
        "4" : 0.100000,
        "8" : 99.998436,
        "16" : 0.000000,
        "32" : 0.000000,
        ">=64" : 0.000000
      },
      "iodepth_submit" : {
        "0" : 0.000000,
        "4" : 100.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.000000
      },
      "iodepth_complete" : {
        "0" : 0.000000,
        "4" : 99.999776,
        "8" : 0.100000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.000000
      },
      "latency_ns" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000
      },
      "latency_us" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.010000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 8.298002,
        "250" : 16.550858,
        "500" : 35.755968,
        "750" : 30.141273,
        "1000" : 5.214859
      },
      "latency_ms" : {
        "2" : 3.043361,
        "4" : 0.731953,
        "10" : 0.174998,
        "20" : 0.088505,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000,
        "2000" : 0.000000,
        ">=2000" : 0.000000
      },
      "latency_depth" : 8,
      "latency_target" : 0,
      "latency_percentile" : 100.000000,
      "latency_window" : 0
    }
  ],
  "disk_util" : [
    {
      "name" : "vda",
      "read_ios" : 621017,
      "write_ios" : 1,
      "read_merges" : 0,
      "write_merges" : 0,
      "read_ticks" : 103766,
      "write_ticks" : 0,
      "in_queue" : 1590,
      "util" : 99.366699
    }
  ]
}

read-4k-0: (groupid=0, jobs=1): err= 0: pid=296: Thu Jan  7 22:38:00 2021
  read: IOPS=5882, BW=22.0MiB/s (24.1MB/s)(689MiB/30001msec)
    slat (usec): min=37, max=11170, avg=107.26, stdev=150.30
    clat (usec): min=2, max=12407, avg=60.54, stdev=150.28
     lat (usec): min=121, max=12543, avg=168.31, stdev=193.68
    clat percentiles (usec):
     |  1.00th=[    3],  5.00th=[    3], 10.00th=[    3], 20.00th=[    3],
     | 30.00th=[    3], 40.00th=[    3], 50.00th=[    3], 60.00th=[    3],
     | 70.00th=[  130], 80.00th=[  135], 90.00th=[  180], 95.00th=[  186],
     | 99.00th=[  223], 99.50th=[  241], 99.90th=[ 1598], 99.95th=[ 2311],
     | 99.99th=[ 7046]
   bw (  KiB/s): min= 9520, max=25307, per=81.36%, avg=19144.85, stdev=2111.06, samples=59
   iops        : min= 2380, max= 6326, avg=4785.85, stdev=527.70, samples=59
  lat (usec)   : 4=63.91%, 10=0.16%, 20=0.09%, 50=0.02%, 100=0.03%
  lat (usec)   : 250=35.36%, 500=0.27%, 750=0.02%, 1000=0.01%
  lat (msec)   : 2=0.03%, 4=0.07%, 10=0.02%, 20=0.01%
  cpu          : usr=3.80%, sys=65.88%, ctx=65099, majf=0, minf=14
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=176495,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
read-4k-1: (groupid=1, jobs=1): err= 0: pid=298: Thu Jan  7 22:38:00 2021
  read: IOPS=14.9k, BW=58.3MiB/s (61.1MB/s)(1748MiB/30001msec)
    slat (usec): min=4, max=18950, avg=48.82, stdev=151.64
    clat (usec): min=4, max=19633, avg=486.18, stdev=518.02
     lat (usec): min=123, max=19638, avg=535.36, stdev=530.38
    clat percentiles (usec):
     |  1.00th=[   89],  5.00th=[   90], 10.00th=[  192], 20.00th=[  208],
     | 30.00th=[  314], 40.00th=[  392], 50.00th=[  461], 60.00th=[  494],
     | 70.00th=[  578], 80.00th=[  594], 90.00th=[  725], 95.00th=[  930],
     | 99.00th=[ 1975], 99.50th=[ 3032], 99.90th=[ 9241], 99.95th=[11076],
     | 99.99th=[11469]
   bw (  KiB/s): min=26679, max=69728, per=99.71%, avg=59483.03, stdev=12061.31, samples=59
   iops        : min= 6669, max=17432, avg=14870.73, stdev=3015.36, samples=59
  lat (usec)   : 10=0.01%, 100=8.30%, 250=16.55%, 500=35.76%, 750=30.14%
  lat (usec)   : 1000=5.21%
  lat (msec)   : 2=3.04%, 4=0.73%, 10=0.17%, 20=0.09%
  cpu          : usr=6.25%, sys=72.49%, ctx=43892, majf=0, minf=22
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=447433,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8

Run status group 0 (all jobs):
   READ: bw=22.0MiB/s (24.1MB/s), 22.0MiB/s-22.0MiB/s (24.1MB/s-24.1MB/s), io=689MiB (723MB), run=30001-30001msec

Run status group 1 (all jobs):
   READ: bw=58.3MiB/s (61.1MB/s), 58.3MiB/s-58.3MiB/s (61.1MB/s-61.1MB/s), io=1748MiB (1833MB), run=30001-30001msec

Disk stats (read/write):
  vda: ios=621017/1, merge=0/0, ticks=103766/0, in_queue=1590, util=99.37%